# Naive Bayes

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
inputs = df.drop('Survived',axis='columns')
target = df.Survived

Dummies are being created here for the column 'sex' since the data frame can't handle text.

In [5]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       1     0

In [6]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0

In [7]:
inputs.drop(['Sex','male'],axis='columns',inplace=True)
inputs.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [8]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [9]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [10]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1
3       1  35.0  53.1000       1
4       3  35.0   8.0500       0

In [11]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.3)

Importing Naive Bayes model from Sikit lib. Named as GaussianNB()

In [12]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [13]:
model.fit(X_train,y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [14]:
model.score(X_test,y_test)

0.8059701492537313

In [15]:
X_test[0:10]

     Pclass        Age      Fare  female
403       3  28.000000   15.8500       0
775       3  18.000000    7.7500       0
627       1  21.000000   77.9583       1
399       2  28.000000   12.6500       1
12        3  20.000000    8.0500       0
611       3  29.699118    7.0500       0
576       2  34.000000   13.0000       1
716       1  38.000000  227.5250       1
28        3  29.699118    7.8792       1
641       1  24.000000   69.3000       1

In [16]:
y_test[0:10]

403    0
775    0
627    1
399    1
12     0
611    0
576    1
716    1
28     1
641    1
Name: Survived, dtype: int64

In [17]:
model.predict(X_test[0:10])

array([0, 0, 1, 1, 0, 0, 1, 1, 1, 1], dtype=int64)

In [18]:
model.predict_proba(X_test[:10])

array([[9.61252900e-01, 3.87471002e-02],
       [9.52216676e-01, 4.77833241e-02],
       [2.42877769e-02, 9.75712223e-01],
       [2.91790043e-01, 7.08209957e-01],
       [9.54482905e-01, 4.55170946e-02],
       [9.60863717e-01, 3.91362828e-02],
       [3.03004440e-01, 6.96995560e-01],
       [1.70977627e-08, 9.99999983e-01],
       [4.81919598e-01, 5.18080402e-01],
       [3.61362846e-02, 9.63863715e-01]])